In [5]:
import pandas as pd
import numpy as np

In [6]:
data = np.random.rand(4,3)

In [7]:
data

array([[0.19193798, 0.70783166, 0.35928839],
       [0.71594693, 0.9093802 , 0.10244263],
       [0.61328369, 0.63811703, 0.52827541],
       [0.39447371, 0.83659923, 0.84749847]])

In [8]:
dataFrame = pd.DataFrame(data)

In [10]:
type(dataFrame[0])

pandas.core.series.Series

In [11]:
dataFrame

          0         1         2
0  0.191938  0.707832  0.359288
1  0.715947  0.909380  0.102443
2  0.613284  0.638117  0.528275
3  0.394474  0.836599  0.847498

In [15]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"], columns = ["Maas", "Yas", "Calisma Saati"])

In [16]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.191938  0.707832       0.359288
Zeynep  0.715947  0.909380       0.102443
Atlas   0.613284  0.638117       0.528275
Mehmet  0.394474  0.836599       0.847498

In [17]:
yeniDataFrame["Yas"]

Atil      0.707832
Zeynep    0.909380
Atlas     0.638117
Mehmet    0.836599
Name: Yas, dtype: float64

In [18]:
yeniDataFrame["Calisma Saati"]

Atil      0.359288
Zeynep    0.102443
Atlas     0.528275
Mehmet    0.847498
Name: Calisma Saati, dtype: float64

In [19]:
yeniDataFrame[["Maas" , "Yas"]]

            Maas       Yas
Atil    0.191938  0.707832
Zeynep  0.715947  0.909380
Atlas   0.613284  0.638117
Mehmet  0.394474  0.836599

In [20]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.191938  0.707832       0.359288
Zeynep  0.715947  0.909380       0.102443
Atlas   0.613284  0.638117       0.528275
Mehmet  0.394474  0.836599       0.847498

In [21]:
yeniDataFrame.loc["Atil"]

Maas             0.191938
Yas              0.707832
Calisma Saati    0.359288
Name: Atil, dtype: float64

In [22]:
yeniDataFrame.loc["Zeynep"]

Maas             0.715947
Yas              0.909380
Calisma Saati    0.102443
Name: Zeynep, dtype: float64

In [23]:
yeniDataFrame.iloc[1]

Maas             0.715947
Yas              0.909380
Calisma Saati    0.102443
Name: Zeynep, dtype: float64

In [25]:
yeniDataFrame["Maas"]

Atil      0.191938
Zeynep    0.715947
Atlas     0.613284
Mehmet    0.394474
Name: Maas, dtype: float64

In [32]:
yeniDataFrame["Emekilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [33]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234
Mehmet  0.394474  0.836599       0.847498       1.673198

In [37]:
yeniDataFrame.drop("Mehmet" , axis = 0)

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234

In [38]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234
Mehmet  0.394474  0.836599       0.847498       1.673198

In [41]:
yeniDataFrame.loc["Atil"]["Calisma Saati"]

0.35928838930839235

In [42]:
yeniDataFrame.loc["Atlas"]["Yas"]

0.6381170304369583

In [43]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234
Mehmet  0.394474  0.836599       0.847498       1.673198

In [44]:
yeniDataFrame < 0

         Maas    Yas  Calisma Saati  Emekilik Yasi
Atil    False  False          False          False
Zeynep  False  False          False          False
Atlas   False  False          False          False
Mehmet  False  False          False          False

In [45]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234
Mehmet  0.394474  0.836599       0.847498       1.673198

In [47]:
yeniDataFrame[yeniDataFrame < 0]

        Maas  Yas  Calisma Saati  Emekilik Yasi
Atil     NaN  NaN            NaN            NaN
Zeynep   NaN  NaN            NaN            NaN
Atlas    NaN  NaN            NaN            NaN
Mehmet   NaN  NaN            NaN            NaN

In [49]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234
Mehmet  0.394474  0.836599       0.847498       1.673198

In [50]:
c

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234
Mehmet  0.394474  0.836599       0.847498       1.673198

In [51]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati  Emekilik Yasi
0    Atil  0.191938  0.707832       0.359288       1.415663
1  Zeynep  0.715947  0.909380       0.102443       1.818760
2   Atlas  0.613284  0.638117       0.528275       1.276234
3  Mehmet  0.394474  0.836599       0.847498       1.673198

In [52]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emekilik Yasi
Atil    0.191938  0.707832       0.359288       1.415663
Zeynep  0.715947  0.909380       0.102443       1.818760
Atlas   0.613284  0.638117       0.528275       1.276234
Mehmet  0.394474  0.836599       0.847498       1.673198

In [53]:
yeniIndeksListesi = ["Ati", "Zey", "Atl", "Meh"]

In [54]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [55]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emekilik Yasi Yeni Indeks
Atil    0.191938  0.707832       0.359288       1.415663         Ati
Zeynep  0.715947  0.909380       0.102443       1.818760         Zey
Atlas   0.613284  0.638117       0.528275       1.276234         Atl
Mehmet  0.394474  0.836599       0.847498       1.673198         Meh

In [56]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati  Emekilik Yasi
Yeni Indeks
Ati          0.191938  0.707832       0.359288       1.415663
Zey          0.715947  0.909380       0.102443       1.818760
Atl          0.613284  0.638117       0.528275       1.276234
Meh          0.394474  0.836599       0.847498       1.673198

In [57]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emekilik Yasi Yeni Indeks
Atil    0.191938  0.707832       0.359288       1.415663         Ati
Zeynep  0.715947  0.909380       0.102443       1.818760         Zey
Atlas   0.613284  0.638117       0.528275       1.276234         Atl
Mehmet  0.394474  0.836599       0.847498       1.673198         Meh

In [58]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [59]:
yeniDataFrame

                 Maas       Yas  Calisma Saati  Emekilik Yasi
Yeni Indeks
Ati          0.191938  0.707832       0.359288       1.415663
Zey          0.715947  0.909380       0.102443       1.818760
Atl          0.613284  0.638117       0.528275       1.276234
Meh          0.394474  0.836599       0.847498       1.673198

In [60]:
yeniDataFrame.loc["Ati"]

Maas             0.191938
Yas              0.707832
Calisma Saati    0.359288
Emekilik Yasi    1.415663
Name: Ati, dtype: float64

In [61]:
ilkIndeksler = ["Simpson" ,"Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [62]:
icIndeksler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [63]:
birlesmisIndeks = list(zip(ilkIndeksler, icIndeksler))

In [64]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [65]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [68]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [69]:
benimCizgiFilmListem = [[40,"A"], [10,"B"], [30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [73]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [76]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas", "meslek"])

In [77]:
cizgiFilmDataFrame

                   Yas meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [78]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [80]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
meslek     E
Name: Kenny, dtype: object

In [81]:
cizgiFilmDataFrame

                   Yas meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [82]:
cizgiFilmDataFrame.index.names = ["Film Ad", "sim"]

In [83]:
cizgiFilmDataFrame

                   Yas meslek
Film Ad   sim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F